In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('cleaned_data.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337 entries, 0 to 336
Data columns (total 28 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         337 non-null    int64
 1   Job Description    337 non-null    object
 2   Rating             337 non-null    int64
 3   Company Name       337 non-null    object
 4   Location           337 non-null    object
 5   Headquarters       337 non-null    object
 6   Size               337 non-null    object
 7   Founded            337 non-null    int64
 8   Type of ownership  337 non-null    object
 9   Industry           337 non-null    object
 10  Sector             337 non-null    object
 11  Revenue            337 non-null    object
 12  Competitors        337 non-null    object
 13  Annual Min         337 non-null    int64
 14  Annual Max         337 non-null    int64
 15  Avg Salary         337 non-null    float64
 16  job_type           337 non-null    object
 17  job_seniority      337 non-null    object
 18  job_len            337 non-null    float64
 19  hq_base            337 non-null    object
 20  hq_city            337 non-null    object
 21  lochq              337 non-null    int64
 22  age                337 non-null    int64
 23  python_yn          337 non-null    int64
 24  R_yn               337 non-null    int64
 25  spark_yn           337 non-null    int64
 26  aws_yn             337 non-null    int64
 27  excel_yn           337 non-null    int64
dtypes: float64(2), int64(12), object(14)
memory usage: 73.8+ KB

In [6]:
df_model = df[['Avg Salary','Rating', 'Size','Type of ownership','Industry', 'Sector', 'Revenue','Competitors','hq_base','lochq','age','python_yn','spark_yn','aws_yn','excel_yn','job_type','job_seniority','job_len']]

In [7]:
df_dum = pd.get_dummies(df_model)

In [8]:
df_dum

,Avg Salary,Rating,lochq,age,python_yn,spark_yn,aws_yn,excel_yn,job_len,Size_1 to 50 employees,...,hq_base_ TX,hq_base_ UT,hq_base_ United Kingdom,hq_base_ VA,hq_base_ WA,hq_base_India,job_type_data scientist,job_seniority_jr,job_seniority_na,job_seniority_senior
0,906841.0,3,0,53,1,1,0,0,2462.0,0,...,0,0,0,0,0,0,1,0,1,0
1,229500.0,3,0,22,1,0,0,0,1452.0,0,...,0,0,0,0,0,0,1,0,1,0
2,2538462.0,3,0,43,1,0,0,0,1777.0,0,...,0,0,0,0,0,0,1,0,1,0
3,1566457.0,4,0,26,1,1,1,1,4616.0,0,...,0,0,0,0,1,0,1,0,1,0
4,434000.0,4,0,25,1,0,0,0,2405.0,0,...,0,0,1,0,0,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
332,223872.0,3,0,-1,0,0,0,0,1845.0,0,...,0,0,0,0,0,0,1,0,0,1
333,20500.0,3,1,-1,1,0,0,0,3589.0,0,...,0,0,0,0,0,0,1,0,0,1
334,54000.0,3,0,-1,1,1,0,0,5094.0,0,...,0,0,0,0,0,0,1,0,1,0
335,752000.0,3,0,11,0,0,0,0,4355.0,0,...,0,0,0,0,0,0,1,0,1,0
336,222500.0,3,0,-1,0,0,0,0,2019.0,0,...,0,0,0,0,0,0,1,0,1,0